app/channels/application_cable/connection.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def find_verified_user
      user_id = session_user_id
      user = user_id && User.find_by(id: user_id)