app/services/achievements.rb

  def grant(user, code, list)
    return nil unless user

    achievement = Achievement.find_by(code: code)
    return nil unless achievement

    membership = UserAchievement.new(user: user, achievement: achievement, list: list)
    return nil unless membership.save # false on the uniqueness validation → already earned

    if achievement.xp_reward.positive?
      new_total = user.xp_total + achievement.xp_reward
      user.update!(xp_total: new_total, level: User.level_for_xp(new_total))
---
SELECT "achievements".* FROM "achievements" WHERE "achievements"."code" = 'first_blood' LIMIT 1
INSERT INTO "user_achievements" ("achievement_id", "created_at", "earned_at", "list_id", "updated_at", "user_id") VALUES (1, '2026-07-03 20:20:00.329786', '2026-07-03 20:20:00.326843', 1, '2026-07-03 20:20:00.329786', 1) RETURNING "id"
UPDATE "users" SET "xp_total" = 120, "level" = 2, "updated_at" = '2026-07-03 20:20:00.346266' WHERE "users"."id" = 1

  def list_complete?(list)
    list.objectives.exists? && !list.objectives.where.not(status: Objective.statuses["done"]).exists?
---
SELECT 1 AS one FROM "objectives" WHERE "objectives"."list_id" = 1 AND "objectives"."status" != 1 LIMIT 1