app/services/gamification.rb

UPDATE "users" SET "last_active_on" = '2026-07-04', "streak_count" = 1, "updated_at" = '2026-07-03 20:20:00.311265', "xp_total" = 70 WHERE "users"."id" = 1
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 1 AND "memberships"."user_id" = 1 LIMIT 1
UPDATE "memberships" SET "xp_in_list" = COALESCE("memberships"."xp_in_list", 0) + 20 WHERE "memberships"."id" = 1
---
  def award_completion(objective, user)
    completed_at = objective.completed_at || Time.current
    xp = xp_for(objective, completed_at: completed_at)
    previous_level = user.level

    user.xp_total += xp
    advance_streak(user, completed_at)
    user.level = User.level_for_xp(user.xp_total)
    user.save!

    membership = objective.list.memberships.find_by(user_id: user.id)
    membership&.increment!(:xp_in_list, xp)