app/services/quest_creator.rb

  def call
    ActiveRecord::Base.transaction do
      list = List.create!(
        name: @params[:name],
        emblem_emoji: @params[:emblem_emoji],
        description: @params[:description],
        cover_color: @params[:cover_color],
        password: @params[:password],
        creator: @user
      )
      membership = list.memberships.create!(user: @user, role: :host)

      apply_template(list)
      create_starter_tags(list)

      Activity.create!(list: list, user: @user, action: "quest.created", target: list)
---
INSERT INTO "lists" ("name", "emblem_emoji", "description", "join_code", "password_digest", "cover_color", "created_by_id", "created_at", "updated_at") VALUES ('Ladakh Trip', '🏔️', NULL, '72US9TM', '$2a$12$hadsNJkXRvTXe1eU0Z2B0OpkA7nLkjH7nJCkxWuT38TDklIi/nbNm', NULL, 2, '2026-07-03 19:12:03.491064', '2026-07-03 19:12:03.491064') RETURNING "id"
INSERT INTO "memberships" ("list_id", "user_id", "role", "xp_in_list", "joined_at", "created_at", "updated_at") VALUES (2, 2, 1, 0, '2026-07-03 19:12:03.502896', '2026-07-03 19:12:03.505357', '2026-07-03 19:12:03.505357') RETURNING "id"
INSERT INTO "activities" ("list_id", "user_id", "action", "target_type", "target_id", "meta", "created_at", "updated_at") VALUES (2, 2, 'quest.created', 'List', 2, '{}', '2026-07-03 19:12:03.588479', '2026-07-03 19:12:03.588479') RETURNING "id"

  def apply_template(list)
    template = load_template(@params[:template_key])
    return unless template

    tags_by_name = {}
    Array(template[:tags]).each do |tag|
      tags_by_name[tag[:name]] = list.tags.create!(name: tag[:name], emoji: tag[:emoji], color: tag[:color])
    end

    Array(template[:objectives]).each_with_index do |obj, index|
      objective = list.objectives.create!(
        title: obj[:title],
        priority: (obj[:priority] || "low").to_s,
        creator: @user,
        position: index
      )
      tag = tags_by_name[obj[:tag]]
      objective.tags << tag if tag
---
INSERT INTO "tags" ("list_id", "name", "emoji", "color", "created_at", "updated_at") VALUES (2, 'Gear', '🎒', '#8b5cf6', '2026-07-03 19:12:03.518922', '2026-07-03 19:12:03.518922') RETURNING "id"
INSERT INTO "objectives" ("list_id", "title", "description", "emoji", "due_on", "priority", "status", "assignee_id", "created_by_id", "completed_by_id", "completed_at", "position", "created_at", "updated_at") VALUES (2, 'Tent & sleeping bags', NULL, NULL, NULL, 1, 0, NULL, 2, NULL, NULL, 0, '2026-07-03 19:12:03.535012', '2026-07-03 19:12:03.535012') RETURNING "id"
INSERT INTO "objective_tags" ("objective_id", "tag_id", "created_at", "updated_at") VALUES (2, 2, '2026-07-03 19:12:03.546514', '2026-07-03 19:12:03.546514') RETURNING "id"

  def create_starter_tags(list)
    Array(@params[:tags]).each do |tag|
      name = tag[:name].to_s.strip
      next if name.blank?
      next if list.tags.exists?([ "lower(name) = ?", name.downcase ])

      list.tags.create!(name: name, emoji: tag[:emoji], color: tag[:color])
---
SELECT 1 AS one FROM "tags" WHERE "tags"."list_id" = 2 AND (lower(name) = 'booking') LIMIT 1
INSERT INTO "tags" ("list_id", "name", "emoji", "color", "created_at", "updated_at") VALUES (2, 'Booking', '🏨', '#38bdf8', '2026-07-03 19:12:03.579975', '2026-07-03 19:12:03.579975') RETURNING "id"