app/channels/list_channel.rb

SELECT "lists".* FROM "lists" WHERE "lists"."join_code" = 'XAAJBBF' LIMIT 1
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 1 AND "memberships"."user_id" = 1 LIMIT 1
---
  def subscribed
    list = List.find_by(join_code: params[:list_code].to_s.strip.upcase)
    membership = list && list.memberships.find_by(user_id: current_user.id)