app/controllers/api/v1/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."list_id" = 1 ORDER BY "activities"."created_at" DESC LIMIT 50
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
      def index
        activities = current_list.activities.includes(:user).recent.limit(50)