app/controllers/api/v1/auth_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."join_code" = 'ZU7ANLW' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'joiner@example.com' LIMIT 1
---
      def create
        email = normalized_email
        code  = normalized_code
        return render_error(:bad_request, "param_missing", "Email and quest code are required.") if email.blank? || code.blank?

        list = List.find_by(join_code: code)
        return render_error(:not_found, "code_not_found", "No quest with that code. Check with the host.") unless list

        if cooldown_active?(email, code)
          return render_error(:too_many_requests, "cooldown", "Too many attempts. Try again in a minute.", retryAfter: COOLDOWN_SECONDS)
        end

        unless list.authenticate(params[:password].to_s)
          tries_left = register_failure(email, code)
          return render_error(:unauthorized, "wrong_password", "That password doesn't match this quest.", triesLeft: tries_left)
        end

        clear_failures(email, code)

        user = User.find_by(email: email)

SELECT "users".* FROM "users" WHERE "users"."email" = 'maker@mail.com' LIMIT 1
---
      def identify
        email = normalized_email
        return render_error(:bad_request, "param_missing", "Email is required.") if email.blank?

        user = User.find_by(email: email)

INSERT INTO "users" ("avatar_emoji", "created_at", "display_name", "email", "last_active_on", "level", "streak_count", "time_zone", "updated_at", "xp_total") VALUES ('🦊', '2026-07-03 19:20:42.851327', 'Maker', 'maker@example.com', NULL, 1, 0, 'Asia/Calcutta', '2026-07-03 19:20:42.851327', 50) RETURNING "id"
---
      def create_player(email)
        user = User.create!(
          email: email,
          display_name: profile_params[:display_name],
          avatar_emoji: profile_params[:avatar_emoji],
          time_zone: params[:time_zone].presence || "UTC",
          xp_total: WELCOME_XP
        )

INSERT INTO "memberships" ("created_at", "joined_at", "list_id", "role", "updated_at", "user_id", "xp_in_list") VALUES ('2026-07-03 19:21:51.357185', '2026-07-03 19:21:51.353899', 2, 0, '2026-07-03 19:21:51.357185', 2, 0) RETURNING "id"
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 2 AND "memberships"."user_id" = 2 LIMIT 1
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('member.joined', '2026-07-03 19:21:51.360042', 2, '{}', 3, 'Membership', '2026-07-03 19:21:51.360042', 2) RETURNING "id"
---
      def join_membership(list, user)
        list.memberships.find_or_create_by!(user_id: user.id) do |m|
          m.role = :member
        end.tap do |membership|
          if membership.previously_new_record?
            Activity.create!(list: list, user: user, action: "member.joined", target: membership)