app/controllers/api/v1/base_controller.rb

      def current_list
        code = (params[:code] || params[:list_code]).to_s.strip.upcase
        @current_list ||= List.find_by!(join_code: code)
---
SELECT "lists".* FROM "lists" WHERE "lists"."join_code" = 'XXJ99VX' LIMIT 1

      def current_membership
        return unless current_user

        @current_membership ||= current_list.memberships.find_by(user_id: current_user.id)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 1 AND "memberships"."user_id" = 1 LIMIT 1