app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "objective_id", "updated_at", "user_id") VALUES ('MH100 fits 3 snugly', '2026-07-03 19:53:01.918834', 1, '2026-07-03 19:53:01.918834', 1) RETURNING "id"
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('comment.created', '2026-07-03 19:53:01.923578', 1, '{}', 1, 'Comment', '2026-07-03 19:53:01.923578', 1) RETURNING "id"
---
      def create
        comment = @objective.comments.create!(user: current_user, body: params[:body])
        Activity.create!(list: @objective.list, user: current_user, action: "comment.created", target: comment)

SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = 1 LIMIT 1
---
      def set_objective
        @objective = Objective.find(params[:objective_id])