app/controllers/api/v1/leaderboard_controller.rb

      def index
        members = current_list.memberships.includes(:user).order(xp_in_list: :desc, joined_at: :asc)
        done_counts = current_list.objectives.done.group(:completed_by_id).count

        rows = members.each_with_index.map do |membership, index|
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 3 ORDER BY "memberships"."xp_in_list" DESC, "memberships"."joined_at" ASC