app/controllers/api/v1/lists_controller.rb

      def index
        memberships = current_user.memberships
                                  .includes(list: [ :objectives, { memberships: :user } ])
                                  .order(joined_at: :desc)

        render json: { lists: memberships.map { |m| quest_card(m) } }
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = 1 ORDER BY "memberships"."joined_at" DESC
SELECT "objectives".* FROM "objectives" WHERE "objectives"."list_id" = 1

      def show
        list = current_list
        total = list.objectives.count
        done = list.objectives.done.count

        render json: {
          list: ListResource.new(list).serializable_hash.merge(
            progress: { total: total, done: done },
            membersCount: list.memberships.count,
            role: current_membership.role
          )
---
SELECT COUNT(*) FROM "objectives" WHERE "objectives"."list_id" = 1
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."list_id" = 1

      def update
        current_list.update!(update_params)
        ListBroadcaster.list_updated(current_list)

        render json: {
          list: ListResource.new(current_list).serializable_hash.merge(
            progress: { total: current_list.objectives.count, done: current_list.objectives.done.count },
            membersCount: current_list.memberships.count,
            role: current_membership.role
          )
---
UPDATE "lists" SET "password_digest" = '$2a$12$EvVnrpOF/O9Utby5RBECRuUIsQMO.SmRxSjTBRaizcKxLWVlaN9wC', "updated_at" = '2026-07-03 20:32:31.242137' WHERE "lists"."id" = 2
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."list_id" = 2
SELECT COUNT(*) FROM "objectives" WHERE "objectives"."list_id" = 2