app/controllers/api/v1/loot_links_controller.rb

      def create
        link = @objective.loot_links.create!(loot_link_params)
        LootLinkFetchJob.perform_later(link.id) if link.title.blank?
        Activity.create!(list: @objective.list, user: current_user, action: "loot_link.created", target: link)
---
INSERT INTO "loot_links" ("created_at", "currency", "image_url", "kind", "objective_id", "price_cents", "title", "updated_at", "url") VALUES ('2026-07-03 19:53:02.656764', 'INR', NULL, 0, 1, NULL, NULL, '2026-07-03 19:53:02.656764', 'https://example.com/mh100') RETURNING "id"
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('loot_link.created', '2026-07-03 19:53:02.674913', 1, '{}', 1, 'LootLink', '2026-07-03 19:53:02.674913', 1) RETURNING "id"

      def set_objective
        @objective = Objective.find(params[:objective_id])
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = 1 LIMIT 1