app/controllers/api/v1/me_controller.rb

      def update
        current_user.update!(params.permit(:display_name, :avatar_emoji))
---
UPDATE "users" SET "display_name" = 'Rahul the Bold', "updated_at" = '2026-07-03 20:30:14.637000' WHERE "users"."id" = 1

      def achievements
        earned = current_user.user_achievements.index_by(&:achievement_id)

        catalog = Achievement.order(:id).map do |achievement|
          user_achievement = earned[achievement.id]
          progress = Achievements.progress_for(current_user, achievement.code)

          AchievementResource.new(achievement).serializable_hash.merge(
            earned: user_achievement.present?,
            earnedAt: user_achievement&.earned_at,
            progress: progress && { current: progress[0], target: progress[1] }
          )
        end

        render json: { achievements: catalog, earnedCount: earned.size, total: catalog.size }
---
SELECT "achievements".* FROM "achievements" ORDER BY "achievements"."id" ASC
SELECT "user_achievements".* FROM "user_achievements" WHERE "user_achievements"."user_id" = 1
SELECT COUNT(*) FROM "user_achievements" WHERE "user_achievements"."user_id" = 2

      def membership_payloads
        current_user.memberships.includes(:list).map do |m|
          list = m.list
          total = list.objectives.count
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = 1
SELECT COUNT(*) FROM "objectives" WHERE "objectives"."list_id" = 1