app/controllers/api/v1/members_controller.rb

      def index
        members = current_list.memberships.includes(:user).order(joined_at: :asc)
        done_counts = current_list.objectives.done.group(:completed_by_id).count

        render json: {
          members: members.map do |m|
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 1 ORDER BY "memberships"."joined_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 4)
SELECT COUNT(*) FROM "memberships" WHERE "memberships"."list_id" = 1
SELECT COUNT(*) FROM "objectives" WHERE "objectives"."list_id" = 1