app/controllers/api/v1/objectives_controller.rb

        scope = current_list.objectives
                            .includes(:assignee, :completer, :tags, :loot_links)
                            .ordered
---
SELECT "loot_links".* FROM "loot_links" WHERE "loot_links"."objective_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9)
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (1, 4, 3, 2)

        scope = scope.joins(:objective_tags).where(objective_tags: { tag_id: params[:tag] }) if params[:tag].present?
---
SELECT "tags".* FROM "tags" INNER JOIN "objective_tags" ON "tags"."id" = "objective_tags"."tag_id" WHERE "objective_tags"."objective_id" = 10

      def create
        objective = current_list.objectives.new(objective_params)
        objective.creator = current_user
        objective.position = (current_list.objectives.maximum(:position) || -1) + 1
        assign_tags(objective)
        objective.save!

        Activity.create!(list: current_list, user: current_user, action: "objective.created", target: objective)
---
SELECT "objectives".* FROM "objectives" WHERE "objectives"."list_id" = 1 ORDER BY "objectives"."position" ASC, "objectives"."created_at" ASC
SELECT MAX("objectives"."position") FROM "objectives" WHERE "objectives"."list_id" = 1
INSERT INTO "objectives" ("assignee_id", "completed_at", "completed_by_id", "created_at", "created_by_id", "description", "due_on", "emoji", "list_id", "position", "priority", "status", "title", "updated_at") VALUES (NULL, NULL, NULL, '2026-07-03 20:06:14.046782', 1, NULL, NULL, NULL, 1, 9, 0, 0, 'Live sync check', '2026-07-03 20:06:14.046782') RETURNING "id"
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('objective.created', '2026-07-03 20:06:14.049584', 1, '{}', 10, 'Objective', '2026-07-03 20:06:14.049584', 1) RETURNING "id"

      def complete
        return render_error(:unprocessable_entity, "already_done", "That's already complete.") if @objective.done?

        @objective.update!(status: :done, completer: current_user, completed_at: Time.current)
        award = Gamification.award_completion(@objective, current_user)
        Activity.create!(list: @objective.list, user: current_user, action: "objective.completed",
                         target: @objective, meta: { xp: award.xp })

        membership = @objective.list.memberships.find_by(user_id: current_user.id)
        ListBroadcaster.objective_completed(@objective.reload, actor: current_user, xp: award.xp, membership: membership)
        ListBroadcaster.member_xp_changed(@objective.list_id, current_user.id, award.xp_in_list, award.level)
        announce_achievements(award.grants)

        render json: {
          objective: detail_json(@objective),
          xpAwarded: award.xp,
          xpTotal: current_user.xp_total,
          level: award.level,
          leveledUp: award.leveled_up,
          newAchievements: award.grants.select { |g| g.user.id == current_user.id }
                                .map { |g| AchievementResource.new(g.achievement).serializable_hash }
---
UPDATE "users" SET "last_active_on" = '2026-07-04', "streak_count" = 1, "updated_at" = '2026-07-03 20:20:00.311265', "xp_total" = 70 WHERE "users"."id" = 1
UPDATE "objectives" SET "completed_at" = '2026-07-03 20:06:14.752206', "completed_by_id" = 1, "status" = 1, "updated_at" = '2026-07-03 20:06:14.752621' WHERE "objectives"."id" = 1
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('objective.completed', '2026-07-03 20:06:14.764617', 1, '{"xp":20}', 1, 'Objective', '2026-07-03 20:06:14.764617', 1) RETURNING "id"
SELECT "memberships".* FROM "memberships" WHERE "memberships"."list_id" = 1 AND "memberships"."user_id" = 1 LIMIT 1
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = 1 LIMIT 1
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1
SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2

      def announce_achievements(grants)
        grants.each do |grant|
          Activity.create!(list: @objective.list, user: grant.user, action: "achievement.earned", target: grant.achievement)
---
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('achievement.earned', '2026-07-03 20:20:00.362581', 1, '{}', 1, 'Achievement', '2026-07-03 20:20:00.362581', 1) RETURNING "id"

      def set_objective
        @objective = Objective.includes(:list, :assignee, :completer, :tags, :loot_links).find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1
SELECT "loot_links".* FROM "loot_links" WHERE "loot_links"."objective_id" = 1
SELECT "objectives".* FROM "objectives" WHERE "objectives"."id" = 1 LIMIT 1
SELECT "tags".* FROM "tags" WHERE "tags"."id" = 1

      def detail_json(objective)
        ObjectiveResource.new(objective).serializable_hash.merge(
          comments: CommentResource.new(objective.comments.includes(:user).order(:created_at)).serializable_hash
        )
---
SELECT "comments".* FROM "comments" WHERE "comments"."objective_id" = 1 ORDER BY "comments"."created_at" ASC