app/controllers/api/v1/tags_controller.rb

SELECT tags.*, COUNT(objective_tags.id) AS objectives_count FROM "tags" LEFT OUTER JOIN "objective_tags" ON "objective_tags"."tag_id" = "tags"."id" WHERE "tags"."list_id" = 1 GROUP BY "tags"."id" ORDER BY "tags"."name" ASC
---
      def index
        tags = current_list.tags
                           .left_joins(:objective_tags)
                           .select("tags.*, COUNT(objective_tags.id) AS objectives_count")
                           .group("tags.id")
                           .order(:name)

INSERT INTO "tags" ("color", "created_at", "emoji", "list_id", "name", "updated_at") VALUES ('#ffc94d', '2026-07-03 20:43:31.218155', '🏔️', 1, 'Camping', '2026-07-03 20:43:31.218155') RETURNING "id"
INSERT INTO "activities" ("action", "created_at", "list_id", "meta", "target_id", "target_type", "updated_at", "user_id") VALUES ('tag.created', '2026-07-03 20:43:31.225379', 1, '{}', 1, 'Tag', '2026-07-03 20:43:31.225379', 1) RETURNING "id"
---
      def create
        tag = current_list.tags.create!(tag_params)
        Activity.create!(list: current_list, user: current_user, action: "tag.created", target: tag)

SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (6, 9, 8, 7)
---
      def set_tag
        @tag = Tag.find(params[:id])