app/models/list.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def host
    memberships.host.first&.user

SELECT 1 AS one FROM "lists" WHERE "lists"."join_code" = 'BF3CR6K' LIMIT 1
---
  def assign_join_code
    return if join_code.present?

    self.join_code = loop do
      candidate = Array.new(7) { CODE_ALPHABET.sample }.join
      break candidate unless self.class.exists?(join_code: candidate)