app/jobs/loot_link_fetch_job.rb

SELECT "loot_links".* FROM "loot_links" WHERE "loot_links"."id" = 1 LIMIT 1
UPDATE "loot_links" SET "title" = 'example.com', "updated_at" = '2026-07-03 19:53:02.764160' WHERE "loot_links"."id" = 1
---
  def perform(loot_link_id)
    link = LootLink.find_by(id: loot_link_id)
    return unless link

    preview = LinkPreview.fetch(link.url)

    updates = {}
    updates[:title] = preview.title if link.title.blank? && preview.title.present?
    updates[:image_url] = preview.image_url if link.image_url.blank? && preview.image_url.present?
    updates[:price_cents] = preview.price_cents if link.price_cents.nil? && preview.price_cents.present?

    return if updates.empty?

    link.update(updates)